'''
Настоящий файл содержит все необходимые классы, методы и функции
для реализации функционала приложения
'''

def parser_tsv(*args, **kwargs):
    '''
    Функция рекурсивно обходит заданную директорию и собирает все пути до tsv файлов в список passes

    :param args:
    :param kwargs:
    :return:
    '''
    pass

def parser_date(*args, **kwargs):
    '''
    Функция рекурсивно обходит заданную директорию и собирает все пути до файлов,
    у которых последняя дата изменения совпадает с заданной

    :param args:
    :param kwargs:
    :return:
    '''
    pass
def custom_diff(*args, **kwargs):
    '''
    Функция берет на вход пути к двум текстовым файлам
    и сравнивает эти файлы.
    Все различия построчно выводит в соответствуюзий log

    :param args:
    :param kwargs:
    :return:
    '''
    pass
